#3.1
r = int (input("3.1 Введите радиус - "))
pi = 3.14159
S = pi * r**2
print ("Площадь круга =", S)

#3.2
a = int (input ("3.2 Введите a = "))
b = int (input ("Введите b ="))
if a == 0:
    print ("Нет корней")
else:
    x = -b/a
print ("x=", x)

#3.3
C = int (input("3.3 Введите температуру по Цельсию = "))
F = 95 * C + 32
print ("Температура по Фаренгейту =", F)


#3.4
m = int (input ("3.4 Введите первое число = "))
n = int (input ("Введите второе число = "))
l = int (input ("Введите третье число = "))
срариф = (m+n+l)/3
print ("Среднее арифметическое = ", срариф)


#3.5
